//===============================================================================
// 
//  C++使った2D(object.cpp)
//								制作：元地弘汰
// 
//===============================================================================
#include "object.h"
#include "manager.h"


//静的メンバの初期化
int CObject::m_nNumAll = 0;
CObject* CObject::m_apObject[SET_PRIORITY][MAX_OBJECT] = {};

//==========================================================================================
//コンストラクタ
//==========================================================================================
CObject::CObject(int nPriority)
{
	m_nPriority = nPriority;
	assert(!(m_nPriority < 0 || m_nPriority > SET_PRIORITY));
	
	for (int i = 0; i < MAX_OBJECT; i++)
	{
		if (m_apObject[m_nPriority][i] == nullptr)
		{
			m_apObject[m_nPriority][i] = this;
			m_nID = i;
			m_nNumAll++;
			break;
		}
	}
}

//==========================================================================================
//デストラクタ
//==========================================================================================
CObject::~CObject()
{

}

//==========================================================================================
//自身を解放
//==========================================================================================
void CObject::Release()
{
	int nID = m_nID;
	int nPriority = m_nPriority;
	if (m_apObject[nPriority][nID] != nullptr)
	{
		m_apObject[nPriority][nID]->Uninit();
		delete m_apObject[nPriority][nID];
		m_apObject[nPriority][nID] = nullptr;
		m_nNumAll--;
	}
}

//==========================================================================================
//オブジェクトのポインタを返す
//==========================================================================================
CObject* CObject::GetObjects(int nPriority,int nIdx)
{
	return m_apObject[nPriority][nIdx];
}

//==========================================================================================
//タイプを設定
//==========================================================================================
void CObject::SetType(TYPE type)
{
	m_type = type;
}

//==========================================================================================
//タイプを返す
//==========================================================================================
CObject::TYPE CObject::GetType()
{
	return m_type;
}

//==========================================================================================
//すべて解放
//==========================================================================================
void CObject::ReleaseAll()
{
	for (int j = 0; j < SET_PRIORITY; j++)
	{
		for (int i = 0; i < MAX_OBJECT; i++)
		{
			if (m_apObject[j][i] != nullptr)
			{
				m_apObject[j][i]->Release();
			}
		}
	}
}

//==========================================================================================
//すべて更新
//==========================================================================================
void CObject::UpdateAll()
{
	for (int j = 0; j < SET_PRIORITY; j++)
	{
		for (int i = 0; i < MAX_OBJECT; i++)
		{
			if (m_apObject[j][i] != nullptr)
			{
				m_apObject[j][i]->Update();
			}
		}
	}
}

//==========================================================================================
//すべて描画
//==========================================================================================
void CObject::DrawAll()
{
	for (int j = 0; j < SET_PRIORITY; j++)
	{
		for (int i = 0; i < MAX_OBJECT; i++)
		{
			if (m_apObject[j][i] != nullptr)
			{
				m_apObject[j][i]->Draw();
			}
		}
	}
}