//===============================================================================
//
//  C++使った3D(result.cpp)
//								制作：元地弘汰
// 
//===============================================================================

#include "manager.h"
#include "fade.h"
#include "object.h"
#include "result.h"

//==========================================================================================
//コンストラクタ
//==========================================================================================
CResult::CResult()
{
	
}

//==========================================================================================
//デストラクタ
//==========================================================================================
CResult::~CResult()
{

}

//==========================================================================================
//初期化処理
//==========================================================================================
HRESULT CResult::Init()
{
	CScene::Init();
	CResultBG::Create();
	m_pScore = CScore::Create({SCREEN_WIDTH * 0.6f,SCREEN_HEIGHT * 0.5f,0.0f});
	m_pScore->LoadLastScore();
	return S_OK;
}

//==========================================================================================
//終了処理
//==========================================================================================
void CResult::Uninit()
{
	if (m_pScore != nullptr)
	{
		m_pScore->Uninit();
		delete m_pScore;
		m_pScore = nullptr;
	}
	CScene::Uninit();
}

//==========================================================================================
//更新処理
//==========================================================================================
void CResult::Update()
{
	if (CManager::GetInstance()->GetKeyboard()->CKeyboard::GetTrigger(DIK_RETURN)|| CManager::GetInstance()->GetJoypad()->GetTrigger(CJoypad::JOYPAD_A))
	{
		CManager::GetInstance()->GetFade()->SetFade(CFade::FADE_IN, CScene::MODE_TITLE);
	}
	CScene::Update();
}

//==========================================================================================
//描画処理
//==========================================================================================
void CResult::Draw()
{
	CScene::Draw();
}


//==========================================================================================
//枠の初期化処理
//==========================================================================================
void CResultBG::Init()
{
	int nIdx = CManager::GetInstance()->GetTexture()->Regist("data\\TEXTURE\\resut.png");
	BindTexture(CManager::GetInstance()->GetTexture()->GetAddress(nIdx), 1, 1);

	CObject::SetType(TYPE_2D_UI);
	CObject2D::Init();
}


//==========================================================================================
//枠の生成処理
//==========================================================================================
CResultBG* CResultBG::Create()
{
	CResultBG* bg = new CResultBG;

	bg->SetPolygonParam({SCREEN_WIDTH * 0.5f,SCREEN_HEIGHT * 0.5f,0.0f}, SCREEN_HEIGHT, SCREEN_WIDTH);
	bg->Init();

	return bg;
}
