//===============================================================================
//
//  アニメーション時の演出用黒帯処理(t_anim_border.cpp)
//								制作：元地弘汰
// 
//===============================================================================
#include "t_anim_border.h"
#include "manager.h"

constexpr float SCR_SizeGap = 80.0f;

//==========================================================================================
//コンストラクタ
//==========================================================================================
CTAnimBorder::CTAnimBorder(int nPriority) :CObject2D(nPriority)
{
	Init();
}

//==========================================================================================
//デストラクタ
//==========================================================================================
CTAnimBorder::~CTAnimBorder()
{

}

//==========================================================================================
//初期化処理
//==========================================================================================
void CTAnimBorder::Init()
{
	CObject::SetType(TYPE_2D_UI);
	CObject2D::Init();
}

//==========================================================================================
//終了処理
//==========================================================================================
void CTAnimBorder::Uninit()
{
	CObject2D::Uninit();
}

//==========================================================================================
//更新処理
//==========================================================================================
void CTAnimBorder::Update()
{
	SetPosToAnim();
	CObject2D::Update();
}

//==========================================================================================
//描画処理
//==========================================================================================
void CTAnimBorder::Draw()
{
	CObject2D::Draw();
}

//==========================================================================================
//生成処理
//==========================================================================================
CTAnimBorder* CTAnimBorder::Create(int type)
{
	CTAnimBorder* number;

	switch (type)
	{
	case 0:
		number = new CTAnimBorderU;
		break;
	case 1:
		number = new CTAnimBorderD;
		break;
	default:
		number = new CTAnimBorder;
		break;
	}
	number->SetPolygonParam({0.0f,0.0f,0.0f}, SCR_SizeGap, SCREEN_WIDTH, { 0.0f,0.0f,0.0f,1.0f });
	number->Init();
	return number;
}

//----------------------------------------------------------------------------------------------------------
//アニメーション用設定

//初期化オーバーロード
void CTAnimBorderU::Init()
{
	CObject2D::SetPos({ SCREEN_WIDTH * 0.5f,-SCR_SizeGap * 0.5f ,0.0f });
}

//目的地ではない場合、動かす(下へ)
void CTAnimBorderU::SetPosToAnim()
{
	if (CObject2D::GetPos().y < SCR_SizeGap * 0.5f)
	{
		CObject2D::AddPos({ 0.0f,SCR_SizeGap * 0.025f,0.0f });
	}
}

//初期化オーバーロード
void CTAnimBorderD::Init()
{
	CObject2D::SetPos({ SCREEN_WIDTH * 0.5f, SCREEN_HEIGHT + SCR_SizeGap * 0.5f,0.0f });
}

//目的地ではない場合、動かす(上へ)
void CTAnimBorderD::SetPosToAnim()
{
	if (CObject2D::GetPos().y > SCREEN_HEIGHT - SCR_SizeGap * 0.5f)
	{
		CObject2D::AddPos({ 0.0f,-SCR_SizeGap * 0.025f,0.0f });
	}
}
//----------------------------------------------------------------------------------------------------------